# Introduction to Pandas
## Topics
- [Series](#Series)
- [DataFrame](#DataFrame)
- [Groupby](#Groupby)
- [Operations](#Operations)
- [Combining DataFrame](#Combining-DataFrame)
- [Data Input and Output](#Data-Input-and-Output)

Pandas is Python library for data analysis.

There are two data structures of pandas.
1. Series (1 dimensional)
2. Data Frame (2 dimensional)

## Series
A Series is very similar to numpy. It is built on top of the NumPy arrary object. 

A Series can have axis labels, while Numpy has only index by location.

In [2]:
import numpy as np
import pandas as pd

In [3]:
my_list = [10,20,30]
arr = np.array([10,20,30])

In [4]:
arr

array([10, 20, 30])

In [9]:
arr[0]

10

### Creating a Series
pd.Series(data, index) [doc](https://pandas.pydata.org/docs/reference/api/pandas.Series.html)

In [4]:
import pandas as pd

In [5]:
ser = pd.Series(data=[10,20,30])

In [6]:
ser

0    10
1    20
2    30
dtype: int64

In [7]:
ser[0]

10

In [8]:
ser = pd.Series(data=[10,20,30],index=['a','b','c'])

In [9]:
ser

a    10
b    20
c    30
dtype: int64

In [10]:
ser['a']

10

#### Creating a series from list

In [13]:
my_list = [10,20,30]
labels = ['a','b','c']
ser = pd.Series(my_list,labels)

In [14]:
ser

a    10
b    20
c    30
dtype: int64

#### Creating a series from NumPy array

In [17]:
arr = np.array([10,20,30])
ser = pd.Series(arr,labels)

In [18]:
ser

a    10
b    20
c    30
dtype: int64

#### Creating a series from dictionary
If index is None, the keys in the data are used as the index.

In [19]:
my_dict = {'a':10, 'b':20 , 'c':30}
ser = pd.Series(my_dict)
ser

a    10
b    20
c    30
dtype: int64

### Data in a Series can hold a variety of object type:

In [25]:
ser = pd.Series(labels)
ser

0    a
1    b
2    c
dtype: object

In [26]:
ser[1]

'b'

### Using an index
Index in Series can be names or number allowing for fast look ups of information

In [27]:
ser1 = pd.Series(data=[1,2,3,4],index=['USA','India','Brazil','Russia'])

In [28]:
ser1

USA       1
India     2
Brazil    3
Russia    4
dtype: int64

In [29]:
ser1['USA']

1

In [43]:
ser1.iloc[2]

3

In [35]:
ser2 = pd.Series([1,2,5,4],['USA','India','Italy','Russia'])

In [37]:
ser2

USA       1
India     2
Italy     5
Russia    4
dtype: int64

In [38]:
ser1+ser2

Brazil    NaN
India     4.0
Italy     NaN
Russia    8.0
USA       2.0
dtype: float64

 ### Setting Series Name

In [27]:
covid = pd.Series(data=[1,2,3,4],index=['USA','India','Brazil','Russia'],name="cases")

In [28]:
covid

USA       1
India     2
Brazil    3
Russia    4
Name: cases, dtype: int64

[Back to Topics](#Topics)

___

## DataFrame

A DataFrame is a 2-dimensional data structure that can store data of different types (including characters, integers, floating point values, categorical data and more) in columns. It is similar to a spreadsheet, a SQL table or the data.frame in R.

Each column in a DataFrame is a Series. 

We can think of a DataFrame as a bunch of Series objects put together to share the same index.

**DataFrame( data , index , columns )**

In [46]:
import pandas as pd
import numpy as np

In [52]:
from numpy.random import randn
np.random.seed(101)

In [53]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(), columns='W X Y Z'.split())

In [54]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
type(df)

pandas.core.frame.DataFrame

### Selecting a column

In [57]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [58]:
type(df['W'])

pandas.core.series.Series

### Selecting multi columns

In [59]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [62]:
#dot syntax BUT NOT RECOMMENDED
df.W

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

### Selecting Rows

#### Selecting rows by label

In [67]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

#### Selecting rows by position instead of label

In [68]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

#### Selecting mutiple rows by label

In [70]:
df.loc[['A','C']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001

In [71]:
df.loc['A':'C']

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [72]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Selecting subset of rows and columns

In [73]:
df.loc['B','X']

-0.31931804459303326

In [74]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [69]:
df['W']

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

### Conditional Selection

In [79]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [84]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [87]:
booldf = df > 0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [93]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [94]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [89]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [90]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [91]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [92]:
df[df['W']>0][['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
D -0.758872  0.955057
E  1.978757  0.683509

#### For complex conditions, use | (logical OR)  and & (logical AND) with parenthesis

In [98]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [99]:
(df['W']>0) | (df['Y']>0)

A    True
B    True
C    True
D    True
E    True
dtype: bool

In [100]:
df[(df['W']>0) | (df['Y']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [101]:
(df['W']>0) & (df['X']>0)

A     True
B    False
C    False
D    False
E     True
dtype: bool

In [102]:
df[(df['W']>0) & (df['X']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

### Creating a new column

In [106]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [107]:
df.sum()

W    1.719289
X    2.268822
Y    2.261436
Z    2.159356
dtype: float64

In [108]:
df.sum(axis=0)

W    1.719289
X    2.268822
Y    2.261436
Z    2.159356
dtype: float64

In [110]:
df.sum(axis=1)

A    4.746778
B    0.089688
C   -1.338233
D   -0.548357
E    5.459028
dtype: float64

In [114]:
# axis 0 is row, axis 1 is column
df.shape

(5, 4)

In [116]:
df['W']+df['X']+df['Y']+df['Z']

A    4.746778
B    0.089688
C   -1.338233
D   -0.548357
E    5.459028
dtype: float64

In [117]:
df['total'] = df.sum(axis=1)

In [118]:
df['total']

A    4.746778
B    0.089688
C   -1.338233
D   -0.548357
E    5.459028
Name: total, dtype: float64

In [119]:
df

          W         X         Y         Z     total
A  2.706850  0.628133  0.907969  0.503826  4.746778
B  0.651118 -0.319318 -0.848077  0.605965  0.089688
C -2.018168  0.740122  0.528813 -0.589001 -1.338233
D  0.188695 -0.758872 -0.933237  0.955057 -0.548357
E  0.190794  1.978757  2.605967  0.683509  5.459028

#### Removing columns

In [124]:
# Drop specified labels from rows or columns.
# default axis = 0, Thus dropping without axis 
# will drop a row.
df.drop('total',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [125]:
#column still exist until inplace specified!
df

          W         X         Y         Z     total
A  2.706850  0.628133  0.907969  0.503826  4.746778
B  0.651118 -0.319318 -0.848077  0.605965  0.089688
C -2.018168  0.740122  0.528813 -0.589001 -1.338233
D  0.188695 -0.758872 -0.933237  0.955057 -0.548357
E  0.190794  1.978757  2.605967  0.683509  5.459028

In [126]:
df.drop('total',axis=1,inplace=True)

In [127]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Can drop rows

In [128]:
df.drop('E',axis=0) # Same as df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [129]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### More Index Details
- Resetting the index
- Setting an index 
- Index hierarchy

In [107]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [131]:
# Reset to default 0, 1, 2, ...
# Use inplace=True to modify DataFrame 
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [109]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [132]:
newind = 'CA NY WY OR CO'.split()

In [133]:
df['States'] = newind

In [134]:
df['States']

A    CA
B    NY
C    WY
D    OR
E    CO
Name: States, dtype: object

In [135]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [137]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [138]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [139]:
df.set_index('States',inplace=True)

In [141]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

[Back to Topics](#Topics)

---

## Groupby
The Groupby method allows to group rows of data together and call aggregate functions

In [160]:
import pandas as pd

In [161]:
covid_death = { 'Continent':['Amer','Amer','Euro','Euro','Asia','Asia'],
          'Country': ['USA','Maxico','Russia','Spain','India','Iran'],
           'Deaths': [7194,715,1136,704,5843,439]}

In [162]:
df = pd.DataFrame(covid_death)

In [163]:
df

  Continent Country  Deaths
0      Amer     USA    7194
1      Amer  Maxico     715
2      Euro  Russia    1136
3      Euro   Spain     704
4      Asia   India    5843
5      Asia    Iran     439

#### Use .groupby() method to group rows together based off of a column name
For instance let's group based off of Continent.

In [164]:
df.groupby('Continent')

In [165]:
by_cont = df.groupby('Continent')

#### Then call aggregate methods  off the object

In [166]:
by_cont.sum()

           Deaths
Continent
Amer         7909
Asia         6282
Euro         1840

In [167]:
by_cont.mean()

           Deaths
Continent
Amer       3954.5
Asia       3141.0
Euro        920.0

In [168]:
by_cont.max()

          Country  Deaths
Continent
Amer          USA    7194
Asia         Iran    5843
Euro        Spain    1136

In [169]:
by_cont.count()

           Country  Deaths
Continent
Amer             2       2
Asia             2       2
Euro             2       2

In [170]:
by_cont.describe()

          Deaths
           count    mean          std    min      25%     50%      75%     max
Continent
Amer         2.0  3954.5  4581.344835  715.0  2334.75  3954.5  5574.25  7194.0
Asia         2.0  3141.0  3821.205046  439.0  1790.00  3141.0  4492.00  5843.0
Euro         2.0   920.0   305.470129  704.0   812.00   920.0  1028.00  1136.0

In [171]:
by_cont.describe().transpose()

Continent            Amer         Asia         Euro
Deaths count     2.000000     2.000000     2.000000
       mean   3954.500000  3141.000000   920.000000
       std    4581.344835  3821.205046   305.470129
       min     715.000000   439.000000   704.000000
       25%    2334.750000  1790.000000   812.000000
       50%    3954.500000  3141.000000   920.000000
       75%    5574.250000  4492.000000  1028.000000
       max    7194.000000  5843.000000  1136.000000

In [172]:
by_cont.describe().T

Continent            Amer         Asia         Euro
Deaths count     2.000000     2.000000     2.000000
       mean   3954.500000  3141.000000   920.000000
       std    4581.344835  3821.205046   305.470129
       min     715.000000   439.000000   704.000000
       25%    2334.750000  1790.000000   812.000000
       50%    3954.500000  3141.000000   920.000000
       75%    5574.250000  4492.000000  1028.000000
       max    7194.000000  5843.000000  1136.000000

In [173]:
by_cont.describe()

          Deaths
           count    mean          std    min      25%     50%      75%     max
Continent
Amer         2.0  3954.5  4581.344835  715.0  2334.75  3954.5  5574.25  7194.0
Asia         2.0  3141.0  3821.205046  439.0  1790.00  3141.0  4492.00  5843.0
Euro         2.0   920.0   305.470129  704.0   812.00   920.0  1028.00  1136.0

In [174]:
by_cont.describe().loc['Amer']

Deaths  count       2.000000
        mean     3954.500000
        std      4581.344835
        min       715.000000
        25%      2334.750000
        50%      3954.500000
        75%      5574.250000
        max      7194.000000
Name: Amer, dtype: float64

In [175]:
by_cont.describe().transpose()

Continent            Amer         Asia         Euro
Deaths count     2.000000     2.000000     2.000000
       mean   3954.500000  3141.000000   920.000000
       std    4581.344835  3821.205046   305.470129
       min     715.000000   439.000000   704.000000
       25%    2334.750000  1790.000000   812.000000
       50%    3954.500000  3141.000000   920.000000
       75%    5574.250000  4492.000000  1028.000000
       max    7194.000000  5843.000000  1136.000000

In [176]:
by_cont.describe().transpose()['Amer']

Deaths  count       2.000000
        mean     3954.500000
        std      4581.344835
        min       715.000000
        25%      2334.750000
        50%      3954.500000
        75%      5574.250000
        max      7194.000000
Name: Amer, dtype: float64

[Back to Topics](#Topics)

---

## Operations
There are lots of operations with pandas that will be really useful

In [6]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### Unique values in Columns

In [4]:
df['col2'].unique()

array([444, 555, 666])

In [6]:
#count unique values
df['col2'].nunique()

3

#### Count column values

In [8]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

#### Applying Functions

In [9]:
def double_value(val):
    return 2*val

In [11]:
df['col1'].apply(double_value)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [12]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

#### Permanently Removing a Column

In [14]:
del df['col1']
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

#### Get Column and Index names

In [16]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [17]:
df.index

RangeIndex(start=0, stop=4, step=1)

#### Sorting and Ordering a DataFrame
[doc](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html#pandas.DataFrame.sort_values)

In [7]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
df.sort_values(by='col2') # inplace = False by default

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [20]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [9]:
df.sort_values(by='col3',ascending=False) # sort by descending

   col1  col2 col3
3     4   444  xyz
2     3   666  ghi
1     2   555  def
0     1   444  abc

#### Find Null Values or Check for Null Values

In [43]:
import numpy as np
import pandas as pd

In [11]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [46]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [47]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

#### Drop rows with NaN Values

In [12]:
# default axis=0, how='any'
df.dropna()

     A    B  C
0  1.0  5.0  1

In [13]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [14]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
# thred => Require that many non-NA values.
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [16]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [17]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

#### Filliing in NaN values with other values

In [32]:
import numpy as np

In [18]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [19]:
df.fillna('-')

  col1   col2 col3
0  1.0      -  abc
1  2.0  555.0  def
2  3.0  666.0  ghi
3    -  444.0  xyz

In [20]:
df['col1'].fillna(value=df['col1'].mean(),inplace=True)

In [21]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   2.0  444.0  xyz

#### Creating a Pivot Table
Create a spreadsheet-style pivot table as a DataFrame. [doc](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.pivot_table.html?highlight=pivot_table#pandas.DataFrame.pivot_table)

In [66]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [40]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [67]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

#### Muti-Index and Index Hierarchy
[doc](https://pandas.pydata.org/docs/reference/api/pandas.MultiIndex.html?highlight=multiindex#pandas.MultiIndex)

In [22]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [23]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [24]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [25]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [75]:
#MultiIndex(
#  levels=[['G1', 'G2'], [1, 2, 3]],
# labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [26]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [27]:
df

             A         B
G1 1  0.640500  1.336045
   2 -0.128090  0.400007
   3  0.387581  0.375828
G2 1 -0.538804  1.805071
   2  0.140080  2.540482
   3  0.006911  0.430498

In [28]:
df['A']

G1  1    0.640500
    2   -0.128090
    3    0.387581
G2  1   -0.538804
    2    0.140080
    3    0.006911
Name: A, dtype: float64

In [36]:
df.loc['G1']

          A         B
1  0.640500  1.336045
2 -0.128090  0.400007
3  0.387581  0.375828

In [37]:
df

             A         B
G1 1  0.640500  1.336045
   2 -0.128090  0.400007
   3  0.387581  0.375828
G2 1 -0.538804  1.805071
   2  0.140080  2.540482
   3  0.006911  0.430498

In [34]:
df.loc['G1'].loc[1]['A']

0.6404997182322277

In [44]:
df.xs(2,level=1)

          A         B
G1 -0.12809  0.400007
G2  0.14008  2.540482

#### Selecting Cross-Section DataFrame [doc](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.xs.html?highlight=xs#pandas.DataFrame.xs)

In [102]:
df.xs('G1')

            A         B
Num
1    0.355044  2.013867
2   -0.567798  0.864951
3   -0.367404 -0.641485

In [112]:
#df.xs(key or tuple)
df.xs(('G1',1))

A    0.355044
B    2.013867
Name: (G1, 1), dtype: float64

In [87]:
df.columns

Index(['A', 'B'], dtype='object')

In [90]:
df.index.names

FrozenList([None, None])

In [45]:
df.index.names =['Group','Num']

In [93]:
df

                  A         B
Group Num
G1    1    0.355044  2.013867
      2   -0.567798  0.864951
      3   -0.367404 -0.641485
G2    1   -0.815049  0.386511
      2    0.405897  1.320858
      3   -1.084149 -1.359681

In [111]:
df.xs(('G1',1))

A    0.355044
B    2.013867
Name: (G1, 1), dtype: float64

In [114]:
df.xs('A',axis=1)

Group  Num
G1     1      0.355044
       2     -0.567798
       3     -0.367404
G2     1     -0.815049
       2      0.405897
       3     -1.084149
Name: A, dtype: float64

In [52]:
df.xs(1,level=1) # level is label or position => same as df.xs(1,level="Num")

              A         B
Group
G1     0.640500  1.336045
G2    -0.538804  1.805071

In [53]:
df.xs(1,level="Num")

              A         B
Group
G1     0.640500  1.336045
G2    -0.538804  1.805071

[Back to Topics](#Topics)

---

## Combining DataFrame
There are 3 main ways of combining DataFrame together: 
- Merging
- Joining
- Concatenating

### Example DataFrames

In [120]:
import pandas as pd

In [121]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [122]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [123]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [125]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [126]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [127]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatenation
Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [130]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [133]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging
The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

#### Example DataFrames

In [139]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3','K4'],
                          'C': ['C0', 'C1', 'C2', 'C3','C4'],
                          'D': ['D0', 'D1', 'D2', 'D3','D4']})

In [141]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [142]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3
4  K4  C4  D4

In [143]:
pd.merge(left,right,how="inner",on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [145]:
pd.merge(left,right,how="outer",on='key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3
4  K4  NaN  NaN  C4  D4

#### Show a more complicate example

In [153]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [155]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [156]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [150]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [161]:
# outer like union in SQL
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [159]:
pd.merge(left,right,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [162]:
pd.merge(left,right,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

#### Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [3]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [166]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [4]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [5]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [171]:
left.join(right,how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [173]:
left.join(right,how="right")

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [174]:
left.join(right,how="left")

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

---

## Data Input and Output
This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [176]:
import numpy as np
import pandas as pd

### CSV
#### CSV Input

In [177]:
df = pd.read_csv('example')

In [179]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### CSV output

In [182]:
covid_death = { 'Continent':['Amer','Amer','Euro','Euro','Asia','Asia'],
          'Country': ['USA','Maxico','Russia','Spain','India','Iran'],
           'Deaths': [7194,715,1136,704,5843,439]}

In [184]:
covid_death

{'Continent': ['Amer', 'Amer', 'Euro', 'Euro', 'Asia', 'Asia'],
 'Country': ['USA', 'Maxico', 'Russia', 'Spain', 'India', 'Iran'],
 'Deaths': [7194, 715, 1136, 704, 5843, 439]}

In [193]:
df = pd.DataFrame(covid_death)

In [194]:
df

  Continent Country  Deaths
0      Amer     USA    7194
1      Amer  Maxico     715
2      Euro  Russia    1136
3      Euro   Spain     704
4      Asia   India    5843
5      Asia    Iran     439

In [195]:
df.to_csv('covid.csv',index=False)

In [197]:
df2 = pd.read_csv('covid.csv')
df2

  Continent Country  Deaths
0      Amer     USA    7194
1      Amer  Maxico     715
2      Euro  Russia    1136
3      Euro   Spain     704
4      Asia   India    5843
5      Asia    Iran     439

### Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

In [204]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [205]:
covid_death = { 'Continent':['Amer','Amer','Euro','Euro','Asia','Asia'],
          'Country': ['USA','Maxico','Russia','Spain','India','Iran'],
           'Deaths': [7194,715,1136,704,5843,439]}
df = pd.DataFrame(covid_death)

In [206]:
df.to_excel('covid.xlsx',sheet_name='Sheet1',index=False)

In [208]:
pd.read_excel('covid.xlsx',sheet_name='Sheet1')

  Continent Country  Deaths
0      Amer     USA    7194
1      Amer  Maxico     715
2      Euro  Russia    1136
3      Euro   Spain     704
4      Asia   India    5843
5      Asia    Iran     439

### HTML and SQL Data 
df = pd.read_html( url )

from sqlalchemy import create_engine

engine = create_engine('sqlite://:memory:')

df.to_sql('data',engine)

sql_df = pd.read_sql('data',con=engine)

[Back to Topics](#Topics)